#ifndef _CONFIGURATION_DEBUG_H
#define _CONFIGURATION_DEBUG_H

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// НАСТРОЙКИ ДЕБАГ-РЕЖИМОВ КОМПИЛЯЦИИ
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//--------------------------------------------------------------------------------------------------------------------------------

//#define _DEBUG // отладочный режим (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define WIFI_DEBUG // режим отладки Wi-Fi-модуля (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define GSM_DEBUG_MODE // режим отладки SMS-модуля (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define LOGGING_DEBUG_MODE // раскомментировать для отладочного режима (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define LCD_DEBUG // отладочный режим LCD-модуля (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define ETHERNET_DEBUG // отладочный режим Ethernet-модуля (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define WATER_DEBUG // отладочный режим модуля полива (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define NRF_DEBUG // отладочный режим nRF, (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define RS485_DEBUG // отладочный режим RS-485, (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define UNI_DEBUG // отладочный режим универсальных модулей (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define PH_DEBUG // раскомментировать для отладочного режима (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)
//#define IOT_UNIT_TEST // режим юнит-тестирования IoT-функционала, не раскомментировать без понимания того, что делаем.
//#define IOT_DEBUG // отладочный режим сервиса IoT
//#define HTTP_DEBUG // отладочный режим провайдеров HTTP-запросов, как правило - надо включать совместно с WIFI_DEBUG (КОНФИГУРАТОР НЕ ЗАПУСКАТЬ, ТОЛЬКО МОНИТОР ПОРТА!)

//--------------------------------------------------------------------------------------------------------------------------------
#endif
