#ifndef _GLOBALS_H
#define _GLOBALS_H

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// НАСТРОЙКИ ПРОШИВКИ
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//--------------------------------------------------------------------------------------------------------------------------------
// определяем типы плат
#define MEGA_BOARD 1 // Arduino Mega
#define DUE_BOARD 2 // Arduino Due
//--------------------------------------------------------------------------------------------------------------------------------

// определяем, под какую плату сейчас компилируем
#define TARGET_BOARD MEGA_BOARD // по умолчанию - Arduino Mega, подставить вместо MEGA_BOARD значение DUE_BOARD, если компилируем под Due.

// подключаем файлы настроек. 
// Настройки для Arduino Mega находятся в файле Configuraton_MEGA.h, 
// для Arduino Due - в файле Configuration_DUE.h.

#if (TARGET_BOARD == MEGA_BOARD)
  #include "Configuration_MEGA.h"
#elif (TARGET_BOARD == DUE_BOARD)
  #include "Configuration_DUE.h"
#else
  #error "Unknown target board!"
#endif

// подключаем настройки отладочных режимов
#include "Configuration_DEBUG.h"

// подключаем общие для всех плат настройки
#include "Configuration_Shared.h"


#endif
